<?php
/*
  __   __                                        ______              __
  \ \  \ \                                      / _____\            / /
   \ \__\ \  __    __  _____   _____    ____   / / ____    _____   / /         
    \  ___ \ \ \  / / / ___ \ / ___ \  / ___\ / / /___ \  / ___ \ /_/
     \ \  \ \ \ \/ / / /__/ // _____/ / /     \ \____/ / / /__/ / __
      \_\  \_\ \  / / _____/ \______//_/       \______/  \_____/ /_/
              _/ / / /
             /__/ /_/
                      HyperGo!|Copyright © 保留所有权利
                           Powered By HyperGo!
                            author HyperLife
*/
namespace multisystemgo\data;

class ConfigData{

  public static $FIX = [
    "可用标签" => [
      "头衔价格" => "{价格}",
      "头衔内容" => "{头衔}"
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "自定义头衔" => [
      "木牌格式" => [
        "第一行" => "§l§b[玩家头衔商店]",
        "第二行" => "§6自定义头衔",
        "第三行" => "§e点击购买该头衔",
        "第四行" => "§a价格: ¥{价格}"
      ],
      "头衔价格" => 666,
      "字数上限" => 10
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "固定义头衔" => [
      "木牌格式" => [
        "第一行" => "§l§b[玩家头衔商店]",
        "第二行" => "§6{头衔}",
        "第三行" => "§e点击购买该头衔",
        "第四行" => "§a价格: ¥{价格}"
      ]
    ],
    "一一一一一一一一一一一一一一一一一一一一",
  ];
    
  public static $SMS = [
    "功能设置" => [
      "可用标签" => [
        "玩家名称" => "{名称}",
        "玩家生命" => "{生命}",
        "护甲指数" => "{护甲}",
        "网络延迟" => "{延迟}",
        "玩家称号" => "{称号}",
        "文本换行" => "{换行}",
        "在线时间" => "{时间}",
        "金币余额" => "{金币}",
        "游戏模式" => "{模式}",
        "物品信息" => "{物品}",
        "世界名称" => "{世界}",
        "在线人数" => "{人数}",
        "玩家坐标" => "{坐标}",
        "玩家配偶" => "{配偶}",
        "玩家头衔" => "{头衔}",
        "玩家战队" => "{战队}",
      ],
      "一一一一一一一一一一一一一一一一一一一一",
      "提示" => "若底部信息与其他插件出现冲突, 请尝试开/关底部兼容选项!",
      "底部显示" => "开",
      "底部兼容" => "关",
      "底部信息" => "我的名称: {名称}  我的称号: {称号}  在线时间: {时间}",
      "隐底世界" => ["地图名称", "以此类推"],
      "聊天美化" => "开",
      "名称美化" => "开",
      "列表美化" => "开",
      "聊天格式" => "§3[{头衔}]§f-§b[{称号}]§f-§6{名称}§e",
      "头部名称" => "§3[{头衔}]§f-§b{称号}§6-§e{名称}",
      "列表格式" => "§e[{名称}]",
      "乘骑按钮" => "乘骑",
      "信息物品" => "3:0",
      "信息文本" => "{换行}玩家名称: {名称}{换行}玩家生命: {生命}",
    ]
  ];
    
  public static $SPS = [
    "功能设置" => [
      "智能优化" => "开",
      "背包保存" => "开",
      "死亡掉落" => "关",
      "死亡背包" => "开",
      "个人箱子" => "开",
      "禁框更新" => "开",
      "火焰保护" => "开",
      "创块禁掉" => "开",
      "进服模式" => 0,
      "死亡经验" => "开",
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "创造设置" => [
      "提示" => "部分方块ID与物品ID有所差别, 请正确填写ID与特殊值!",
      "白名单" => ["玩家名称", "以此类推"],
      "禁止放置方块" => ["方块ID:特殊值", "以此类推", "记得要用双引号括起来"],
      "禁止使用方块" => ["方块ID:特殊值", "以此类推", "记得要用双引号括起来"],
      "禁止破坏方块" => ["方块ID:特殊值", "以此类推", "记得要用双引号括起来"],
      "禁止使用物品" => ["物品ID:特殊值", "以此类推", "记得要用双引号括起来"]
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "生存设置" => [
      "提示" => "部分方块ID与物品ID有所差别, 请正确填写ID与特殊值!",
      "白名单" => ["玩家名称", "以此类推"],
      "禁止放置方块" => ["方块ID:特殊值", "以此类推", "记得要用双引号括起来"],
      "禁止使用方块" => ["方块ID:特殊值", "以此类推", "记得要用双引号括起来"],
      "禁止破坏方块" => ["方块ID:特殊值", "以此类推", "记得要用双引号括起来"],
      "禁止使用物品" => ["物品ID:特殊值", "以此类推", "记得要用双引号括起来"]
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "世界设置" => [],
    "一一一一一一一一一一一一一一一一一一一一",
    "指令设置" => [
      "提示" => "该配置选项为限制指令只允许后台执行, 白名单玩家不受影响",
      "白名单" => ["玩家名称", "以此类推"],
      "后台限制" => [
        "/stop",
        "/特权 顶级特权",
        "/特权 高级特权",
        "/特权 普通特权",
        "以此类推"
      ]
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "聊天设置" => [
      "消息字数上限" => 50,
      "敏感词汇屏蔽" => [
        "傻逼",
        "辣鸡",
        "尼玛"
      ]
    ],
    "一一一一一一一一一一一一一一一一一一一一"
  ];
    
  public static $PPS = [
    "功能设置" => [
      "可用标签" => [
        "玩家名称" => "{名称}",
        "玩家生命" => "{生命}",
        "护甲指数" => "{护甲}",
        "玩家称号" => "{称号}",
        "文本换行" => "{换行}",
        "在线时间" => "{时间}",
        "金币余额" => "{金币}",
        "游戏模式" => "{模式}",
        "物品信息" => "{物品}",
        "世界名称" => "{世界}",
        "在线人数" => "{人数}",
        "玩家坐标" => "{坐标}",
        "玩家配偶" => "{配偶}",
        "玩家头衔" => "{头衔}",
        "玩家战队" => "{战队}",
      ],
      
      "进服提示" => "开",
      "进服信息" => "§6天空一声巨响, §6{称号}玩家 §e{名称} §6闪亮登场!",
      "进服闪电" => "开",
      "传送闪电" => "开",
      "附加血量" => "开",
      "披风变幻" => "开",
      "变幻时间" => 5,
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "普通玩家" => [
      "普通称号" => "普通玩家",
      "附加血条" => 0,
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "普通特权" => [
      "特权称号" => "普通特权",
      "飞行模式" => "开",
      "切换模式" => "开",
      "模式界限" => [0, 1, 2, 3],
      "特权传送" => "开",
      "改变时间" => "开",
      "时间冷却" => 300,
      "改变尺寸" => "开",
      "附加血条" => 1,
      "特权电击" => "开",
      "电击冷却" => 30,
      "电击伤害" => 2,
      "燃放烟花" => "开",
      "烟花冷却" => 30,
      "伪装玩家" => "开",
      "伪装实体" => "开",
      "伪装方块" => "开",
      "点地弹跳" => "开",
      "特权乘骑" => "开",
      "多倍矿物" => "开",
      "矿物倍数" => 2,
      "潜行隐身" => "开",
      "特权披风" => "开",
      "倒置身体" => "开"
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "高级特权" => [
      "特权称号" => "高级特权",
      "飞行模式" => "开",
      "切换模式" => "开",
      "模式界限" => [0, 1, 2, 3],
      "特权传送" => "开",
      "改变时间" => "开",
      "时间冷却" => 300,
      "改变尺寸" => "开",
      "附加血条" => 2,
      "特权电击" => "开",
      "电击冷却" => 30,
      "电击伤害" => 4,
      "燃放烟花" => "开",
      "烟花冷却" => 30,
      "伪装玩家" => "开",
      "伪装实体" => "开",
      "伪装方块" => "开",
      "点地弹跳" => "开",
      "特权乘骑" => "开",
      "多倍矿物" => "开",
      "矿物倍数" => 4,
      "潜行隐身" => "开",
      "特权披风" => "开",
      "倒置身体" => "开"
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "顶级特权" => [
      "特权称号" => "顶级特权",
       "飞行模式" => "开",
       "切换模式" => "开",
       "模式界限" => [0, 1, 2, 3],
       "特权传送" => "开",
       "改变时间" => "开",
       "时间冷却" => 300,
       "改变尺寸" => "开",
       "附加血条" => 3,
       "特权电击" => "开",
       "电击冷却" => 30,
       "电击伤害" => 6,
       "燃放烟花" => "开",
       "烟花冷却" => 30,
       "伪装玩家" => "开",
       "伪装实体" => "开",
       "伪装方块" => "开",
       "点地弹跳" => "开",
       "特权乘骑" => "开",
       "多倍矿物" => "开",
       "矿物倍数" => 6,
       "潜行隐身" => "开",
       "特权披风" => "开",
       "倒置身体" => "开"
    ],
    "一一一一一一一一一一一一一一一一一一一一",
  ];
    
  public static $PRS = [
    "功能设置" => [
      "战队最低基金" => 666,
      "队名字数上限" => 10,
      "战队初始人数" => 20,
      "修改队名费用" => 100,
      "战队升级费用" => 100,
      "战队升级人数" => 20,
      "队友攻击队友" => "开",
    ],
    "一一一一一一一一一一一一一一一一一一一一",
    "战队木牌" => [
      "可用标签" => [
        "战队名称" => "{队名}",
        "战队人数" => "{人数}",
        "战队基金" => "{基金}",
        "战队队长" => "{队长}",
      ],
      "一一一一一一一一一一一一一一一一一一一一",
      "木牌刷新时间" => 10,
      "战队宣传木牌" => [
        "第一行" => "==={队名} 战队===",
        "第二行" => "战队队长: {队长}",
        "第三行" => "战队人数: {人数}",
        "第四行" => "战队基金: {基金}",
      ],
      "人数排行木牌" => [
        "第一行" => "§l§d<<<§c玩家战队排行榜§d>>>",
        "第二行" => "§b玩家战队人数排行榜",
        "第三行" => "§b点击查看人数排行榜",
        "第四行" => "§l§d<<<<<<<<§c一§d>>>>>>>>",
        "排行榜" => "§e{队名} §6战队§f-§6人数: §e{人数}",
        "排行量" => 5,
      ],
      "基金排行木牌" => [
        "第一行" => "§l§d<<<§c玩家战队排行榜§d>>>",
        "第二行" => "§b玩家战队基金排行榜",
        "第三行" => "§b点击查看基金排行榜",
        "第四行" => "§l§d<<<<<<<<§c一§d>>>>>>>>",
        "排行榜" => "§e{队名} §6战队§f-§6基金: §e{基金}",
        "排行量" => 5,
      ],
    ],
    "一一一一一一一一一一一一一一一一一一一一",
  ];
      
  public static $PLS = [
    "功能设置" => [
      "牺牲冷却" => 300,
    ],
    "一一一一一一一一一一一一一一一一一一一一",
  ];
  
}